Revit 2026 API

# ConductorMaterial Class

---

This class represents the definition of Conductor Material data.

SystemObject Autodesk.Revit.DB.ElectricalConductorMaterial

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConductorMaterial : IDisposable
```
```vb
Public Class ConductorMaterial
	Implements IDisposable
```
```cpp
public ref class ConductorMaterial : IDisposable
```
```fsharp
type ConductorMaterial =
    class
        interface IDisposable
    end
```

The ConductorMaterial type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Material id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Material name. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Material. |
|  | Dispose | Releases all resources used by the ConductorMaterial |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetConductorMaterial | Gets the Conductor Material data by given Conductor Material id. |
|  | GetConductorMaterialIdByName | Gets the Conductor Material id by given Conductor Material name. |
|  | GetConductorMaterialIds | Gets all the Conductor Material ids in the given document, sorted by name. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace